{"user":{"examName":"TNPSC Group 1","examDate":"2026-09-06","studyHoursPerDay":4,"language":"en","preferredMethods":["General AI Strategy"]},"syllabus":[{"subject":"Preliminary Examination","topics":[{"name":"UNIT - I: GENERAL SCIENCE","subtopics":["Scientific Knowledge and Scientific Temper - Power of Reasoning - Rote Learning vs Conceptual Learning - Science as a tool to understand the past, present and future.","Nature of Universe - General Scientific Laws – Mechanics - Properties of Matter, Force, Motion and Energy - Everyday application of the Basic Principles of Mechanics, Electricity and Magnetism, Light, Sound, Heat, Nuclear Physics, Laser, Electronics and Communications.","Elements and Compounds, Acids, Bases, Salts, Petroleum Products, Fertilisers, Pesticides.","Main concepts of Life Science, Classification of Living Organisms, Evolution, Genetics, Physiology, Nutrition, Health and Hygiene, Human Diseases.","Environment and Ecology."]},{"name":"UNIT - II: CURRENT EVENTS","subtopics":["History - Latest diary of events - National symbols - Profile of States - Eminent personalities and places in news – Sports - Books and authors.","Polity - Political parties and political system in India - Public awareness and General administration - Welfare oriented Government schemes and their utility, Problems in Public Delivery Systems.","Geography - Geographical landmarks.","Economics - Current socio - economic issues.","Science - Latest inventions in Science and Technology.","Prominent Personalities in various spheres – Arts, Science, Literature and Philosophy."]},{"name":"UNIT - III: GEOGRAPHY OF INDIA","subtopics":["Location – Physical features - Monsoon, Rainfall, Weather and Climate - Water Resources - Rivers in India - Soil, Minerals and Natural Resources - Forest and Wildlife - Agricultural pattern.","Transport - Communication.","Social Geography – Population density and distribution - Racial, Linguistic Groups and Major Tribes.","Natural calamity – Disaster Management – Environmental pollution: Reasons and preventive measures – Climate change – Green energy."]},{"name":"UNIT – IV: HISTORY AND CULTURE OF INDIA","subtopics":["Indus Valley Civilization - Guptas, Delhi Sultans, Mughals and Marathas - Age of Vijayanagaram and Bahmani Kingdoms - South Indian History.","Change and Continuity in the Socio - Cultural History of India.","Characteristics of Indian Culture, Unity in Diversity – Race, Language, Custom.","India as a Secular State, Social Harmony."]},{"name":"UNIT - V: INDIAN POLITY","subtopics":["Constitution of India - Preamble to the Constitution - Salient features of the Constitution - Union, State and Union Territory.","Citizenship, Fundamental Rights, Fundamental Duties, Directive Principles of State Policy.","Union Executive, Union Legislature – State Executive, State Legislature – Local Governments, Panchayat Raj.","Spirit of Federalism: Centre - State Relationships.","Election - Judiciary in India – Rule of Law.","Corruption in Public Life – Anti - corruption measures – Lokpal and Lok Ayukta - Right to Information - Empowerment of Women - Consumer Protection Forums, Human Rights Charter."]},{"name":"UNIT - VI: INDIAN ECONOMY","subtopics":["Nature of Indian Economy – Five year plan models - an assessment – Planning Commission and Niti Ayog.","Sources of revenue – Reserve Bank of India – Fiscal Policy and Monetary Policy - Finance Commission – Resource sharing between Union and State Governments - Goods and Services Tax.","Structure of Indian Economy and Employment Generation, Land Reforms and Agriculture - Application of Science and Technology in Agriculture - Industrial growth - Rural Welfare Oriented Programmes – Social Problems – Population, Education, Health, Employment, Poverty."]},{"name":"UNIT - VII: INDIAN NATIONAL MOVEMENT","subtopics":["National Renaissance – Early uprising against British rule - Indian National Congress - Emergence of leaders – B.R.Ambedkar, Bhagat Singh, Bharathiar, V.O.Chidambaranar Jawaharlal Nehru, Kamarajar, Mahatma Gandhi, Maulana Abul Kalam Azad, Thanthai Periyar, Rajaji, Subash Chandra Bose, Rabindranath Tagore and others.","Different modes of Agitation: Growth of Satyagraha and Militant Movements.","Communalism and Partition."]},{"name":"UNIT - VIII: History, Culture, Heritage and Socio - Political Movements in Tamil Nadu","subtopics":["History of Tamil Society, related Archaeological discoveries, Tamil Literature from Sangam Age till contemporary times.","Thirukkural: Significance as a Secular Literature, Relevance to Everyday Life, Impact of Thirukkural on Humanity, Thirukkural and Universal Values - Equality, Humanism, etc, Relevance to Socio - Politico - Economic affairs, Philosophical content in Thirukkural.","Role of Tamil Nadu in freedom struggle - Early agitations against British Rule - Role of women in freedom struggle.","Evolution of 19th and 20th Century Socio - Political Movements in Tamil Nadu - Justice Party, Growth of Rationalism - Self Respect Movement, Dravidian Movement and Principles underlying both these Movements, Contributions of Thanthai Periyar and Perarignar Anna."]},{"name":"UNIT – IX: Development Administration in Tamil Nadu","subtopics":["Human Development Indicators in Tamil Nadu and a comparative assessment across the Country – Impact of Social Reform Movements in the Socio - Economic Development of Tamil Nadu.","Political parties and Welfare schemes for various sections of people – Rationale behind Reservation Policy and access to Social Resources - Economic trends in Tamil Nadu – Role and impact of social welfare schemes in the Socio - Economic Development of Tamil Nadu.","Social Justice and Social Harmony as the Cornerstones of Socio - Economic Development.","Education and Health Systems in Tamil Nadu.","Geography of Tamil Nadu and its impact on Economic growth.","Achievements of Tamil Nadu in various fields.","e - Governance in Tamil Nadu."]},{"name":"UNIT - X: APTITUDE AND MENTAL ABILITY","subtopics":["Simplification – Percentage - Highest Common Factor (HCF) - Lowest Common Multiple (LCM).","Ratio and Proportion.","Simple interest - Compound interest - Area - Volume - Time and Work.","Logical Reasoning - Puzzles - Dice - Visual Reasoning - Alpha numeric Reasoning – Number Series."]}]},{"subject":"Main Examination","topics":[{"name":"PAPER - I: Compulsory Tamil Language Eligibility Test (SSLC Standard)","subtopics":["Translation (Tamil to English, English to Tamil).","Precis Writing.","Comprehension.","Expansion of ideas from short notes.","Essay writing on Thirukkural: Significance as a Secular Literature, Relevance to Everyday Life, Impact on Humanity, Universal Values (Equality, Humanism, etc.), Relevance to Socio-Politico-Economic affairs, Philosophical content.","Letter Writing (Official).","Tamil Language knowledge.","Current Events.","Social Issues.","Environmental topics.","Indian Economy topics.","Science and Technology.","Art and Culture.","Rationalist movements - Dravidian movement, Self Respect movement.","Contemporary Tamil language - Computer Tamil, Court Tamil, Official language Tamil, New types.","Tamil Nadu's socio-economic progress and Tamil Nadu government's welfare schemes (women, farmers…), role of social reform movements in implementing social welfare schemes - reservation and its benefits - role of social justice and social unity in Tamil Nadu's socio-economic development.","Writing in own sentences, knowing meaning difference, splitting words, antonyms, negative sentences, correcting errors.","Essay writing on Thirukkural (same subtopics as above)."]},{"name":"PAPER - II: General Studies (Degree Standard)","subtopics":["UNIT - I: Modern history of India and Indian culture: Advent of European invasion – Expansion and consolidation of British rule - Early uprising against British rule – 1857 Revolt - Indian National Congress – Growth of militant movements - Different modes of agitations - Emergence of national leaders – Gandhi, Nehru, Tagore, Netaji, Moulana Abulkalam Azad, Ambedkar and Patel - Era of different Acts & Pacts - Second World War & final phase struggle - Communalism led to partition.","UNIT - I: Modern history of India and Indian culture: Effect of British rule on socio - economic factors - National renaissance - Socio religious reform movements.","UNIT - I: Modern history of India and Indian culture: India since independence - Characteristics of Indian culture - Unity in diversity - Race, Language, Religion Custom - India: a secular state - Organizations for fine arts, dance, drama and music.","UNIT - I: Modern history of India and Indian culture: Role of Tamil Nadu in freedom struggle - Bharathiar, VOC, Subramania Siva, Rajaji, Periyar and others - Political parties and Welfare schemes.","UNIT - I: Modern history of India and Indian culture: Latest diary of events: National and International - National symbols - Eminent personalities & places in news - Sports & Games - Books & Authors - Awards & Honours - Cultural panorama - Latest historical events - Latest terminology - Appointments - who is who?","UNIT - II: Social issues in India and Tamil Nadu: Population Explosion - Unemployment issues in India & Tamil Nadu - Child Abuse & Child Labour - Poverty - Rural and Urban Sanitation – Illiteracy.","UNIT - II: Social issues in India and Tamil Nadu: Women Empowerment - Role of the Government in Women Empowerment - Social injustice to Women - Domestic violence, Dowry menace, Sexual assault - Role of women and women’s organisations.","UNIT - II: Social issues in India and Tamil Nadu: Social changes in India - Urbanization and its impact on the society – Problems and remedies - Impact of violence on Society – Religious violence, Terrorism and Communal violence - Regional Disparities - Problems of Minorities - Human Rights issues.","UNIT - II: Social issues in India and Tamil Nadu: Education – Linkage between Education and Social Development - Community Development Programmes - Employment Guarantee Schemes - Self Employment and Entrepreneurship Development - Role of N.G.Os in Social Welfare – Government Policy on Health.","UNIT - II: Social issues in India and Tamil Nadu: Welfare Schemes for vulnerable sections of the population by the Central and State governments and their performance.","UNIT - II: Social issues in India and Tamil Nadu: Current Affairs.","UNIT - III: General Aptitude & Mental Ability (SSLC Standard): Conversion of information to data - Collection, compilation and presentation of data - Tables, Graphs, Diagrams - Parametric representation of data - Analytical interpretation of data - Percentage - Highest Common Factor (HCF) - Lowest Common Multiple (LCM) - Ratio and Proportion - Simple interest - Compound interest - Area - Volume - Time and Work - Probability.","UNIT - III: General Aptitude & Mental Ability (SSLC Standard): Information technology - Basic terms, Communications - Application of Information and Communication Technology (ICT) - Decision making and problem solving - Basics in Computers / Computer terminology."]},{"name":"PAPER - III: General Studies (Degree Standard)","subtopics":["UNIT - I: Indian Polity and emerging political trends across the world affecting India: Constitution of India: Historical background - Making of the Indian Constitution - Preamble - Salient features of the Indian Constitution - Fundamental Rights and Fundamental Duties - Directive Principles of State Policy - Schedules to the Indian Constitution.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Union Executive: President, Vice - President, Prime Minister and Council of Ministers, Attorney General of India.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Union Legislature: Parliament: Lok - Sabha and Rajya - Sabha - Composition, Powers, Functions and Legislative procedures.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Union Judiciary: Structure, Powers and Functions of the Supreme Court - Judicial Review - Latest Verdicts.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: State Executive: Governor, Chief Minister - Speaker and Council of Ministers, Advocate General of the State.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: State Legislature: State Legislative Assembly - Organization, Powers and Functions.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: State Judiciary: Organisation, Powers and Functions of High Courts, District Courts and Subordinate Courts.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Local Government: Historical Development - Features and working of 73rd and 74th Constitutional Amendment Act, 1992.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Union Territories: Evolution of States and Union Territories - Administration of Union Territories.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Federalism in India: Centre - State Relations - Centre - State Administrative Relations - Centre - State Legislative Relations and Centre - State Financial Relations.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Civil Services in India: Historical background - Classification of Civil Services – Recruitment & Training of Civil Servants.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: State Services: Classification of State Services and Recruitment.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Official Language: Constitutional provision - Official Language Act, VIII Schedule to the Constitution.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Amendments: Major Amendments to the Indian Constitution.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Special Status to Jammu & Kashmir: Art 370.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Political Parties: National & Regional parties, Pressure Groups, Interest Groups, Public Opinion, Mass Media, Non - Governmental Organizations (NGOs) and their role.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Issue Areas in Indian Administration: Corruption in India - Anti - Corruption Measures - CVC - Lok Adalats - Ombudsman - RTI Act - Minister - Secretary Relationship - Generalist vs. Specialist controversy.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Constitutional and Non - Constitutional Bodies - Composition, Powers and Functions.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Profile of States - Defence, National Security and Terrorism - World Organisations - Pacts and Summits.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: India's Foreign Policy: Foreign Affairs with Special emphasis on India's relations with neighbouring countries and in the region - Security and defence related issues - Nuclear Policy - Issues and conflicts. The Indian Diaspora and its contribution to India and to the World.","UNIT - I: Indian Polity and emerging political trends across the world affecting India: Current Affairs.","UNIT - II: Role and impact of Science and Technology in the development of India: Science and Technology – Role, Achievements and Developments - Their applications and effects in everyday life - Energy - Conventional and Non - conventional – Self sufficiency - Oil exploration - Defence Research Organizations and other science and technology institutions - Ocean Research and Development - Role and Functions.","UNIT - II: Role and impact of Science and Technology in the development of India: Advancements in the fields of I.T., Space, Computers, Robotics, Nano - Technology - Mobile Communication - Remote sensing and its benefits.","UNIT - II: Role and impact of Science and Technology in the development of India: Health and hygiene - Human diseases - Prevention and remedies - Communicable diseases and non - communicable diseases - Genetic Engineering - Organ transplantation - Stem cell Technology - Medical Tourism - Advancements in Horticulture & Agriculture.","UNIT - II: Role and impact of Science and Technology in the development of India: Achievements of Indians in the fields of Science and Technology.","UNIT - II: Role and impact of Science and Technology in the development of India: Latest inventions in science & technology.","UNIT - III: Tamil Society - Its Culture and Heritage: Tamil Society: Origin and expansion.","UNIT - III: Tamil Society - Its Culture and Heritage: Art and Culture: Literature, Music, Film, Drama, Architecture, Sculpture, Paintings and Folk Arts.","UNIT - III: Tamil Society - Its Culture and Heritage: Socio - economic history of Tamil Nadu from Sangam age to till date.","UNIT - III: Tamil Society - Its Culture and Heritage: Growth of Rationalist, Dravidian movements in Tamil Nadu - Their role in the socio – economic development of Tamil Nadu.","UNIT - III: Tamil Society - Its Culture and Heritage: Social and cultural life of contemporary Tamils: Caste, Religion, Women, Politics, Education, Economy, Trade and relationship with other countries.","UNIT - III: Tamil Society - Its Culture and Heritage: Tamil and other Disciplines: Mass Media, Computer etc."]},{"name":"PAPER - IV: General Studies (Degree Standard)","subtopics":["UNIT - I: Geography of India with special reference to Tamil Nadu: Location - Physical features - Major Rivers - Weather & Climate - Monsoon, Rainfall - Natural resources: - Soil, Water, Forest, Minerals and Wild life - Agricultural pattern – Livestock - Fisheries - Industries; Major industries - Growth and Development - Social - Cultural geography - Population : Growth, Density and Distribution - Racial, linguistic and major tribes.","UNIT - I: Geography of India with special reference to Tamil Nadu: Oceanography - Bottom relief features of Indian Ocean, Arabian Sea and Bay of Bengal.","UNIT - I: Geography of India with special reference to Tamil Nadu: Basics of Geospatial Technology: Geographical Information System (GIS) and Global Navigation Satellite System (GNSS).","UNIT - I: Geography of India with special reference to Tamil Nadu: Map: Geographical landmarks - India and its neighbours.","UNIT - I: Geography of India with special reference to Tamil Nadu: Current Affairs.","UNIT II: Environment, Biodiversity and Disaster Management: Ecology: Structure and function of Ecosystem – Ecological succession - Biodiversity conservation: Types – Biodiversity Hot Spots in India – Biodiversity: Significance and Threats – In situ and Ex situ conservation measures – Roles of Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES), International Union for Conservation of Nature (IUCN) & Convention on Biological Diversity (CBD).","UNIT II: Environment, Biodiversity and Disaster Management: Environmental Pollution and Management: Air, Water, Soil, Thermal and Noise pollution and control strategies – Solid and Hazardous waste management - Environmental Impact Assessment (EIA): Steps in EIA process – Environmental Clearance – Environmental Auditing.","UNIT II: Environment, Biodiversity and Disaster Management: Climate Change: Global Environmental Issues and Management – Changes in monsoon pattern in Tamil Nadu and India – Environmental consequences of climate change and mitigation measures – Clean and Green Energy – Environmental Sustainability.","UNIT II: Environment, Biodiversity and Disaster Management: Environmental Laws, Policies & Treaties in India and Global scenario - Natural calamities and Disaster Management – Environmental Health and Sanitation.","UNIT II: Environment, Biodiversity and Disaster Management: Current Affairs.","UNIT III: Indian Economy - Current economic trends and impact of global economy on India: Features of Indian Economy – Demographical profile of India – National Income – Capital formation - NEP (New Economic Policy) – NITI AYOG – National Development Council.","UNIT III: Indian Economy - Current economic trends and impact of global economy on India: Agriculture – Role of Agriculture – Land reforms – New Agricultural Strategy – Green Revolution – Price Policy, Public Distribution System (PDS), Subsidy, Food Security – Agricultural Marketing, Crop Insurance, Labour – Rural credit & indebtness – WTO & Agriculture.","UNIT III: Indian Economy - Current economic trends and impact of global economy on India: Industry - Growth - Policy – Role of public sector and disinvestment – Privatisation and Liberalization – Public Private Partnership (PPP) – SEZs. – MSMEs. – Make in India.","UNIT III: Indian Economy - Current economic trends and impact of global economy on India: Infrastructure in India – Transport System - Energy – Power – Communication - Social Infrastructure - Science & Technology - R&D.","UNIT III: Indian Economy - Current economic trends and impact of global economy on India: Banking & Finance – Banking, Money & Finance – Central Bank – Commercial Bank – NBFIs. - Stock Market – Financial Reforms – Financial Stability – Monetary Policy – RBI & Autonomy.","UNIT III: Indian Economy - Current economic trends and impact of global economy on India: Public Finance – Sources of Revenue – Tax & Non - Tax Revenue – Canons of taxation – GST – Public expenditure – Public debt – Finance Commission – Fiscal Policy.","UNIT III: Indian Economy - Current economic trends and impact of global economy on India: Issues in Indian Economy – Poverty & inequality – Poverty alleviation programmes – MGNREGA – New Welfare programmes for rural poverty – Unemployment – Inflation – Inflation targeting – Sustainable economic growth – Gender issues.","UNIT III: Indian Economy - Current economic trends and impact of global economy on India: India’s Foreign Trade – BOP, EX - IM Policy, FOREX Market, FDI; Globalization & its impact – Global economic crisis & impact on Indian economy.","UNIT III: Indian Economy - Current economic trends and impact of global economy on India: International Agencies – IMF (International Monetary Fund) World Bank - BRICS - SAARC - ASEAN.","UNIT III: Indian Economy - Current economic trends and impact of global economy on India: Tamil Nadu Economy & Issues – Gross State Domestic Product – Trends in State’s economic growth – Demographic profile of Tamil Nadu – Agriculture – Industry & entrepreneurship development in Tamil Nadu – Infrastructure – Power, Transportation systems – Social Infrastructure – SHGs. & Rural Women empowerment – Rural poverty & unemployment – Environmental issues – Regional economic disparities – Local Government - Recent government welfare programmes.","UNIT III: Indian Economy - Current economic trends and impact of global economy on India: Current Affairs."]}]}],"schedule":[{"id":"day-1","date":"2026-02-02","type":"STUDY","tasks":["UNIT - I: GENERAL SCIENCE - Mechanics, Properties of Matter, Force, Motion and Energy (2 hours)","UNIT - X: APTITUDE AND MENTAL ABILITY - Simplification, Percentage (2 hours)"],"isCompleted":true,"completedTasks":["UNIT - I: GENERAL SCIENCE - Mechanics, Properties of Matter, Force, Motion and Energy (2 hours)","UNIT - X: APTITUDE AND MENTAL ABILITY - Simplification, Percentage (2 hours)"]},{"id":"day-2","date":"2026-02-03","type":"STUDY","tasks":["UNIT - V: INDIAN POLITY - Preamble to the Constitution, Salient features of the Constitution (2 hours)","UNIT - II: CURRENT EVENTS - Latest diary of events (National), National symbols (2 hours)"],"isCompleted":false},{"id":"day-3","date":"2026-02-04","type":"STUDY","tasks":["UNIT - VIII: History of Tamil Society, related Archaeological discoveries, Tamil Literature from Sangam Age (2 hours)","UNIT - VIII: Thirukkural: Significance as a Secular Literature, Relevance to Everyday Life (2 hours)"],"isCompleted":false},{"id":"day-4","date":"2026-02-05","type":"STUDY","tasks":["UNIT - VII: INDIAN NATIONAL MOVEMENT - National Renaissance, Early uprising against British rule (2 hours)","UNIT - I: GENERAL SCIENCE - Main concepts of Life Science, Classification of Living Organisms (2 hours)"],"isCompleted":false},{"id":"day-5","date":"2026-02-06","type":"STUDY","tasks":["UNIT - IX: Development Administration in Tamil Nadu - Human Development Indicators, Impact of Social Reform Movements (2 hours)","UNIT - X: APTITUDE AND MENTAL ABILITY - HCF, LCM, Ratio and Proportion (2 hours)"],"isCompleted":false},{"id":"day-6","date":"2026-02-07","type":"MOCK_TEST","tasks":["Attempt a full-length Preliminary Examination Mock Test"],"isCompleted":false},{"id":"day-7","date":"2026-02-08","type":"REVISION","tasks":["Review Mock Test performance","Revise topics covered in Week 1 (General Science, Polity, TN History, INM, TN Dev. Admin, Aptitude, Current Events)"],"isCompleted":false},{"id":"day-8","date":"2026-02-09","type":"STUDY","tasks":["UNIT - III: GEOGRAPHY OF INDIA - Location, Physical features, Monsoon, Rainfall, Weather and Climate (2 hours)","UNIT - VI: INDIAN ECONOMY - Nature of Indian Economy, Five year plan models - an assessment (2 hours)"],"isCompleted":false},{"id":"day-9","date":"2026-02-10","type":"STUDY","tasks":["UNIT - V: INDIAN POLITY - Citizenship, Fundamental Rights, Fundamental Duties (2 hours)","UNIT - II: CURRENT EVENTS - Profile of States, Eminent personalities and places in news (2 hours)"],"isCompleted":false},{"id":"day-10","date":"2026-02-11","type":"STUDY","tasks":["UNIT - VIII: Evolution of 19th and 20th Century Socio - Political Movements in Tamil Nadu - Justice Party, Growth of Rationalism (2 hours)","UNIT - VIII: Thirukkural: Impact of Thirukkural on Humanity, Thirukkural and Universal Values (Equality, Humanism) (2 hours)"],"isCompleted":false},{"id":"day-11","date":"2026-02-12","type":"STUDY","tasks":["UNIT - IV: HISTORY AND CULTURE OF INDIA - Indus Valley Civilization, Guptas (2 hours)","UNIT - I: GENERAL SCIENCE - Environment and Ecology (2 hours)"],"isCompleted":false},{"id":"day-12","date":"2026-02-13","type":"STUDY","tasks":["UNIT - IX: Development Administration in Tamil Nadu - Political parties and Welfare schemes, Rationale behind Reservation Policy (2 hours)","UNIT - X: APTITUDE AND MENTAL ABILITY - Simple interest, Compound interest (2 hours)"],"isCompleted":false},{"id":"day-13","date":"2026-02-14","type":"MOCK_TEST","tasks":["Attempt a full-length Preliminary Examination Mock Test"],"isCompleted":false},{"id":"day-14","date":"2026-02-15","type":"REVISION","tasks":["Review Mock Test performance","Revise topics covered in Week 2 (Geography, Economy, Polity, TN Movements, Indian History, General Science, TN Dev. Admin, Aptitude, Current Events)"],"isCompleted":false},{"id":"day-15","date":"2026-02-16","type":"STUDY","tasks":["UNIT - VI: INDIAN ECONOMY - Sources of revenue, Reserve Bank of India, Fiscal Policy and Monetary Policy (2 hours)","UNIT - III: GEOGRAPHY OF INDIA - Water Resources, Rivers in India, Soil, Minerals and Natural Resources (2 hours)"],"isCompleted":false},{"id":"day-16","date":"2026-02-17","type":"STUDY","tasks":["UNIT - V: INDIAN POLITY - Union Executive, Union Legislature (2 hours)","UNIT - II: CURRENT EVENTS - Sports, Books and authors (2 hours)"],"isCompleted":false},{"id":"day-17","date":"2026-02-18","type":"STUDY","tasks":["UNIT - VIII: Role of Tamil Nadu in freedom struggle - Early agitations against British Rule, Role of women in freedom struggle (2 hours)","Mains Paper I (Thirukkural Essay): Practice essay writing on Thirukkural's relevance to Socio-Politico-Economic affairs (2 hours)"],"isCompleted":false},{"id":"day-18","date":"2026-02-19","type":"STUDY","tasks":["UNIT - IV: HISTORY AND CULTURE OF INDIA - Delhi Sultans, Mughals and Marathas (2 hours)","UNIT - I: GENERAL SCIENCE - Electricity and Magnetism, Light, Sound, Heat (2 hours)"],"isCompleted":false},{"id":"day-19","date":"2026-02-20","type":"STUDY","tasks":["UNIT - IX: Development Administration in Tamil Nadu - Social Justice and Social Harmony, Education and Health Systems in Tamil Nadu (2 hours)","UNIT - X: APTITUDE AND MENTAL ABILITY - Area, Volume (2 hours)"],"isCompleted":false},{"id":"day-20","date":"2026-02-21","type":"MOCK_TEST","tasks":["Attempt a full-length Preliminary Examination Mock Test"],"isCompleted":false},{"id":"day-21","date":"2026-02-22","type":"REVISION","tasks":["Review Mock Test performance","Revise topics covered in Week 3 (Economy, Geography, Polity, TN Freedom Struggle, Indian History, General Science, TN Dev. Admin, Aptitude, Current Events)"],"isCompleted":false},{"id":"day-22","date":"2026-02-23","type":"STUDY","tasks":["UNIT - VII: INDIAN NATIONAL MOVEMENT - Emergence of leaders (Gandhi, Nehru, Ambedkar, Periyar, etc.) (2 hours)","UNIT - VI: INDIAN ECONOMY - Industrial growth, Rural Welfare Oriented Programmes (2 hours)"],"isCompleted":false},{"id":"day-23","date":"2026-02-24","type":"STUDY","tasks":["UNIT - III: GEOGRAPHY OF INDIA - Transport, Communication, Social Geography (Population, Racial, Linguistic Groups) (2 hours)","UNIT - II: CURRENT EVENTS - Geographical landmarks, Current socio - economic issues (2 hours)"],"isCompleted":false},{"id":"day-24","date":"2026-02-25","type":"STUDY","tasks":["UNIT - VIII: Dravidian Movement and Principles, Contributions of Thanthai Periyar and Perarignar Anna (2 hours)","Mains Paper I (Tamil Language): Translation (Tamil to English, English to Tamil) practice (2 hours)"],"isCompleted":false},{"id":"day-25","date":"2026-02-26","type":"STUDY","tasks":["UNIT - V: INDIAN POLITY - State Executive, State Legislature, Local Governments, Panchayat Raj (2 hours)","UNIT - I: GENERAL SCIENCE - Elements and Compounds, Acids, Bases, Salts, Petroleum Products (2 hours)"],"isCompleted":false},{"id":"day-26","date":"2026-02-27","type":"STUDY","tasks":["UNIT - IX: Development Administration in Tamil Nadu - Achievements of Tamil Nadu in various fields, e - Governance in Tamil Nadu (2 hours)","UNIT - X: APTITUDE AND MENTAL ABILITY - Time and Work, Logical Reasoning - Puzzles (2 hours)"],"isCompleted":false},{"id":"day-27","date":"2026-02-28","type":"MOCK_TEST","tasks":["Attempt a full-length Preliminary Examination Mock Test"],"isCompleted":false},{"id":"day-28","date":"2026-03-01","type":"REVISION","tasks":["Review Mock Test performance","Revise topics covered in Week 4 (INM, Economy, Geography, TN Movements, Polity, General Science, TN Dev. Admin, Aptitude, Current Events, Tamil Language)"],"isCompleted":false},{"id":"day-29","date":"2026-03-02","type":"STUDY","tasks":["UNIT - VI: INDIAN ECONOMY - Social Problems (Population, Education, Health, Employment, Poverty) (2 hours)","UNIT - IV: HISTORY AND CULTURE OF INDIA - Age of Vijayanagaram and Bahmani Kingdoms, South Indian History (2 hours)"],"isCompleted":false},{"id":"day-30","date":"2026-03-03","type":"STUDY","tasks":["UNIT - V: INDIAN POLITY - Corruption in Public Life, Anti - corruption measures, Lokpal and Lok Ayukta, Right to Information (2 hours)","UNIT - II: CURRENT EVENTS - Latest inventions in Science and Technology, Prominent Personalities in various spheres (2 hours)"],"isCompleted":false}],"logs":{},"streak":0,"longestStreak":0,"level":1,"xp":0,"badges":[],"hardTopics":[],"lastUpdateDate":null,"questionPapersContent":"","streakHistory":[],"motivation":"Your effort makes a difference.","currentAffairs":[{"id":"ca-0","title":"Union Budget 2026-27 Presented","summary":"Union Finance Minister Nirmala Sitharaman presented the Union Budget 2026-27 in the Lok Sabha on February 1, 2026. This marks her record ninth consecutive Budget presentation. The budget focuses on accelerating and sustaining economic growth, building human capacity, and ensuring inclusive development across regions, sectors, and social groups.","category":"NATIONAL, ECONOMY","date":"February 1, 2026","sources":[{"uri":"https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG8HV3BvQtpBmY-kGMn4DU_u8EIIwgBjDwWziGubvHZ7ElDk7ouN_v1g5293NIT7l0eXwMcGrX5AlSCY35FQnQpjrOpyLQN4mpgtGkqqDYUYw_RcTRojEK80L7zJCYlp7wkijlk6iQV5XjD4ltAPk9U2rarUPuqGSp-mdP6barXh3XqPA==","title":"guidely.in"},{"uri":"https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHgrrgcmIfXAk-FM0xy1EuudXjHcKIUwNhu0BWSBTWr2t5ICJpAPKdL-o0HaLEi1euTnnoVhX8d8rqj5DmnJg4rsL8h9CzxlM2_bkdxWkRvrSZvOeg9dRDfU7qBE66dYeXrJ2q70RDURMUUeTE0kYCQwzIjo-7a7ijTGiQgUPTIcBtcLf7cz8qNZ0Pf0J8thlY4kLf5EKuxlcAIBHWZFF8=","title":"vajiramandravi.com"}]},{"id":"ca-1","title":"Indian-Origin Scientist Veerabhadran Ramanathan Wins Crafoord Prize 2026","summary":"Indian-origin climate scientist Veerabhadran Ramanathan has been awarded the prestigious Crafoord Prize 2026, often referred to as the 'Nobel of Geosciences'. His groundbreaking discoveries on greenhouse gases have significantly reshaped climate science and global environmental policy.","category":"SCIENCE, INTERNATIONAL","date":"February 3, 2026","sources":[{"uri":"https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG8HV3BvQtpBmY-kGMn4DU_u8EIIwgBjDwWziGubvHZ7ElDk7ouN_v1g5293NIT7l0eXwMcGrX5AlSCY35FQnQpjrOpyLQN4mpgtGkqqDYUYw_RcTRojEK80L7zJCYlp7wkijlk6iQV5XjD4ltAPk9U2rarUPuqGSp-mdP6barXh3XqPA==","title":"guidely.in"},{"uri":"https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHgrrgcmIfXAk-FM0xy1EuudXjHcKIUwNhu0BWSBTWr2t5ICJpAPKdL-o0HaLEi1euTnnoVhX8d8rqj5DmnJg4rsL8h9CzxlM2_bkdxWkRvrSZvOeg9dRDfU7qBE66dYeXrJ2q70RDURMUUeTE0kYCQwzIjo-7a7ijTGiQgUPTIcBtcLf7cz8qNZ0Pf0J8thlY4kLf5EKuxlcAIBHWZFF8=","title":"vajiramandravi.com"}]},{"id":"ca-2","title":"India-EU Free Trade Agreement (FTA) Concluded","summary":"Prime Minister Narendra Modi and European Commission President Ursula von der Leyen officially concluded the India-EU Free Trade Agreement (FTA) at the 16th India-EU Summit in New Delhi. This historic agreement, dubbed the 'mother of all deals,' is expected to provide preferential, zero-duty access for over 99% of Indian exports to the EU market.","category":"INTERNATIONAL, ECONOMY","date":"January 27, 2026","sources":[{"uri":"https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG8HV3BvQtpBmY-kGMn4DU_u8EIIwgBjDwWziGubvHZ7ElDk7ouN_v1g5293NIT7l0eXwMcGrX5AlSCY35FQnQpjrOpyLQN4mpgtGkqqDYUYw_RcTRojEK80L7zJCYlp7wkijlk6iQV5XjD4ltAPk9U2rarUPuqGSp-mdP6barXh3XqPA==","title":"guidely.in"},{"uri":"https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHgrrgcmIfXAk-FM0xy1EuudXjHcKIUwNhu0BWSBTWr2t5ICJpAPKdL-o0HaLEi1euTnnoVhX8d8rqj5DmnJg4rsL8h9CzxlM2_bkdxWkRvrSZvOeg9dRDfU7qBE66dYeXrJ2q70RDURMUUeTE0kYCQwzIjo-7a7ijTGiQgUPTIcBtcLf7cz8qNZ0Pf0J8thlY4kLf5EKuxlcAIBHWZFF8=","title":"vajiramandravi.com"}]},{"id":"ca-3","title":"Tamilaga Vettri Kazhagam (TVK) Allotted 'Whistle' Symbol for 2026 Assembly Elections","summary":"The Election Commission of India (ECI) has allotted the 'Whistle' symbol to the Tamilaga Vettri Kazhagam (TVK), led by actor-politician Vijay, for the upcoming 2026 Tamil Nadu Assembly elections. This marks a significant step for the party's formal entry into the electoral arena.","category":"STATE","date":"January 27, 2026","sources":[{"uri":"https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG8HV3BvQtpBmY-kGMn4DU_u8EIIwgBjDwWziGubvHZ7ElDk7ouN_v1g5293NIT7l0eXwMcGrX5AlSCY35FQnQpjrOpyLQN4mpgtGkqqDYUYw_RcTRojEK80L7zJCYlp7wkijlk6iQV5XjD4ltAPk9U2rarUPuqGSp-mdP6barXh3XqPA==","title":"guidely.in"},{"uri":"https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHgrrgcmIfXAk-FM0xy1EuudXjHcKIUwNhu0BWSBTWr2t5ICJpAPKdL-o0HaLEi1euTnnoVhX8d8rqj5DmnJg4rsL8h9CzxlM2_bkdxWkRvrSZvOeg9dRDfU7qBE66dYeXrJ2q70RDURMUUeTE0kYCQwzIjo-7a7ijTGiQgUPTIcBtcLf7cz8qNZ0Pf0J8thlY4kLf5EKuxlcAIBHWZFF8=","title":"vajiramandravi.com"}]},{"id":"ca-4","title":"Union Budget 2026-27 Boosts Astronomy Infrastructure","summary":"The Union Budget 2026-27 announced a major expansion of India's ground-based astronomy infrastructure. Plans include establishing and upgrading four key facilities across Ladakh and southern India, with initiatives aimed at strengthening capabilities in solar physics, deep-space observation, and public science education.","category":"SCIENCE","date":"February 3, 2026","sources":[{"uri":"https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG8HV3BvQtpBmY-kGMn4DU_u8EIIwgBjDwWziGubvHZ7ElDk7ouN_v1g5293NIT7l0eXwMcGrX5AlSCY35FQnQpjrOpyLQN4mpgtGkqqDYUYw_RcTRojEK80L7zJCYlp7wkijlk6iQV5XjD4ltAPk9U2rarUPuqGSp-mdP6barXh3XqPA==","title":"guidely.in"},{"uri":"https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHgrrgcmIfXAk-FM0xy1EuudXjHcKIUwNhu0BWSBTWr2t5ICJpAPKdL-o0HaLEi1euTnnoVhX8d8rqj5DmnJg4rsL8h9CzxlM2_bkdxWkRvrSZvOeg9dRDfU7qBE66dYeXrJ2q70RDURMUUeTE0kYCQwzIjo-7a7ijTGiQgUPTIcBtcLf7cz8qNZ0Pf0J8thlY4kLf5EKuxlcAIBHWZFF8=","title":"vajiramandravi.com"}]},{"id":"ca-5","title":"Solid Waste Management (SWM) Rules, 2026 Notified","summary":"The Ministry of Environment, Forest and Climate Change has notified the Solid Waste Management (SWM) Rules, 2026. The new framework emphasizes a 'waste hierarchy' prioritizing prevention and reduction, followed by reuse, recycling, recovery, and disposal, and introduces clear penalties for non-compliance.","category":"NATIONAL","date":"February 2, 2026","sources":[{"uri":"https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQG8HV3BvQtpBmY-kGMn4DU_u8EIIwgBjDwWziGubvHZ7ElDk7ouN_v1g5293NIT7l0eXwMcGrX5AlSCY35FQnQpjrOpyLQN4mpgtGkqqDYUYw_RcTRojEK80L7zJCYlp7wkijlk6iQV5XjD4ltAPk9U2rarUPuqGSp-mdP6barXh3XqPA==","title":"guidely.in"},{"uri":"https://vertexaisearch.cloud.google.com/grounding-api-redirect/AUZIYQHgrrgcmIfXAk-FM0xy1EuudXjHcKIUwNhu0BWSBTWr2t5ICJpAPKdL-o0HaLEi1euTnnoVhX8d8rqj5DmnJg4rsL8h9CzxlM2_bkdxWkRvrSZvOeg9dRDfU7qBE66dYeXrJ2q70RDURMUUeTE0kYCQwzIjo-7a7ijTGiQgUPTIcBtcLf7cz8qNZ0Pf0J8thlY4kLf5EKuxlcAIBHWZFF8=","title":"vajiramandravi.com"}]}]}